tutorials/UCM/Allrun
#!/bin/sh

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Get application name
application=`getApplication`

runApplication blockMesh

runApplication decomposePar

echo "Running viscoelasticFluidFoam solver"
echo "UCM model:"
runParallel $application

runApplication reconstructPar

echo "done!"
